## SQL 1

In [ ]:
# import statements

#### Installation requirements

You can either run `pip3 install pandas` on your ssh session or try doing the installation from the notebook.

### Running linux commands from jupyter notebook

In [ ]:
#pwd

In [ ]:
#ls

In [ ]:
!pip3 install pandas

In [ ]:
engine = 
conn =

In [ ]:
# show tables

### Table creation

#### `Students` table
Let's create `Students` table with columns:
- `sid(int)` - primary key
- `name(text)` - required
- `gpa(float)`

In [ ]:
list(conn.execute(text("show tables;")))

### Inserting data

Let's add a student: example: 101, "Alice", 3.2

In [ ]:
conn.execute(text("""
    
"""))

In [ ]:
conn.execute(text("""
    INSERT INTO Students (sid, name, gpa) 
    VALUES (123, "Bob", 3.8)
"""))

### Projection aka `SELECT` clause in SQL

Retrieving all or specific columns from a table.

### Updating data

Let's change Alice's GPA to 3.7

In [ ]:
conn.execute(text("""
    
"""))

In [ ]:
pd.read_sql("SELECT * FROM Students", conn)

#### `Courses` table
Let's create accounts `Courses` with columns:
- `cid(int)` - primary key
- `cname(text)` - required
- `credits(int)` - required

In [ ]:
conn.execute(text("""
    create table Courses (
    cid int, 
    cname text ?, 
    credits int ?, 
    primary key(cid))
"""))

In [ ]:
list(conn.execute(text("show tables;")))

### Table deletion

What if we wanted to delete a table?

In [ ]:
conn.execute(text(""))

Let's recreate `Courses` table. This time, let's make `cid` type `VARCHAR(255)` instead of int.

In [ ]:
conn.execute(text("""
    create table Courses (
    cid VARCHAR(255) PRIMARY KEY, 
    cname text NOT NULL, 
    credits int NOT NULL)
"""))

Let's insert the two courses from the slide example.

In [ ]:
conn.execute(text("""
    INSERT INTO Courses (cid, cname, credits) 
    VALUES ("CS544", "Big Data", 3)
"""))
conn.execute(text("""
    INSERT INTO Courses (cid, cname, credits) 
    VALUES ("CS639", "Data Management", 3)
"""))

#### `Enrolled` table

Let's create `Enrolled` table with columns:
- sid(int) - foreign key
- cid(VARCHAR (255)) - foreign key
- grade(text)

In [ ]:
conn.execute(text("""
    create table Enrolled (sid int, cid VARCHAR(255), grade text,
                           ?,
                           ?
"""))

In [ ]:
list(conn.execute(text("show tables;")))

Let's add the erollments from the slide example.

In [ ]:
conn.execute(text("""
    INSERT INTO Enrolled (sid, cid, grade) 
    VALUES (123, "CS544", "A")
"""))
conn.execute(text("""
    INSERT INTO Enrolled (sid, cid, grade) 
    VALUES (101, "CS639", "A")
"""))

In [ ]:
pd.read_sql("SELECT * FROM Courses", conn)

What if we try to enroll a non-existing student?

In [ ]:
# doesn't work - no foreign key mapping
conn.execute(text("""
    INSERT INTO Enrolled (sid, cid, grade) VALUES (10, "No one", "Nothing")
"""))

Commit the transaction.

In [ ]:
conn.commit()

What if we try to delete Student with id 101 from Students table?

In [ ]:
# doesn't work - foreign key prevents this
conn.execute(text("""
    DELETE FROM Students WHERE sid = 101
"""))

### Load CSVs to MySQL Tables

### Spotify dataset: https://ms.sites.cs.wisc.edu/cs639/data/spotify.zip

In [ ]:
base_url = "https://ms.sites.cs.wisc.edu/cs639/data/"
df = pd.read_csv(base_url + "spotify.zip", compression="zip")
df.?

In [ ]:
pd.read_sql("SELECT * FROM songs", conn)

## SQL 2: Basic SQL clauses

Let's drop all the tables that we created so far.

In [ ]:
# you have to drop the table with foreign key constraint first
conn.execute(text("drop table Enrolled"))
conn.execute(text("drop table Students"))
conn.execute(text("drop table Courses"))
conn.execute(text("drop table songs"))

In [ ]:
list(conn.execute(text("show tables;")))

### IMDB dataset

- Source: https://datasets.imdbws.com/ 
- Original dataset is too large to be analyzed using our current VM
- Schema information: https://developer.imdb.com/non-commercial-datasets/

Let's download a sampled version of the dataset.

In [ ]:
!
!
!wget https://ms.sites.cs.wisc.edu/cs639/data/IMDB.zip
!unzip IMDB.zip

#### Populating MySQL server with tables corresponding to all tsv files

In [ ]:
files = os.listdir()
files

In [ ]:
tsv_files = [f for f in files if ".tsv" in f]
tsv_files

In [ ]:
table_names = [f.replace(".tsv", "") for f in tsv_files]
table_names = [f.replace(".", "_") for f in table_names]
table_names

In [ ]:
list(conn.execute(text("show tables;")))

### Explore the tables

In [ ]:
# name_basics
pd.read_sql("SELECT * FROM name_basics LIMIT 5", conn)

In [ ]:
# title_akas
pd.read_sql("SELECT * FROM title_akas LIMIT 5", conn)

In [ ]:
# title_basics
pd.read_sql("SELECT * FROM title_basics LIMIT 5", conn)

In [ ]:
# title_crew
pd.read_sql("SELECT * FROM title_crew LIMIT 5", conn)

In [ ]:
# title_episode
pd.read_sql("SELECT * FROM title_episode LIMIT 5", conn)

In [ ]:
# title_principals
pd.read_sql("SELECT * FROM title_principals LIMIT 5", conn)

In [ ]:
# title_ratings
pd.read_sql("SELECT * FROM title_ratings LIMIT 5", conn)

### Data Analysis

#### Q1: What are the movies?

In [ ]:
pd.read_sql("""
    
""", conn)

#### Q2: What are all the movie titles and their corresponding release years? Eliminate movies without release years.

Which table can we find this data from?

In [ ]:
pd.read_sql("""
    SELECT 
    FROM title_basics
    WHERE titleType = 'movie'
""", conn)

#### Q3: How many movies are in this dataset?

In [ ]:
pd.read_sql("""
    SELECT 
    FROM title_basics
    WHERE titleType = 'movie'
""", conn)

#### Q4: What are all the types of titles in this dataset?

In [ ]:
pd.read_sql("""
    SELECT 
    FROM title_basics
""", conn)

#### Q5: How many title types are there in this dataset?

In [ ]:
pd.read_sql("""
    SELECT 
    FROM title_basics
""", conn)

#### Q6: What are all the movies that got released in 2023?

#### Q7: What is the average rating of all titles?

In [ ]:
pd.read_sql("""
    SELECT 
    FROM title_ratings
""", conn)

#### Q8: What are all the movies that have runtime greater than 2 hours?

In [ ]:
pd.read_sql("""
    SELECT *
    FROM title_basics
    WHERE titleType = 'movie' and 
""", conn)

#### Q9: What are all the "Comedy" movies?

In [ ]:
pd.read_sql("""
    SELECT *
    FROM title_basics
    WHERE genres
""", conn)

#### Q10: Find the total number of people in the dataset.

In [ ]:
pd.read_sql("""
    SELECT
    FROM name_basics
""", conn)

#### Q11: What are the distinct primary professions of individuals in the dataset?

#### Q12: What are the total number of alternate titles listed in the dataset?

#### Q13: What is the total runtime in the dataset?

In [ ]:
pd.read_sql("""
    SELECT 
    FROM title_basics
    WHERE runtimeMinutes
""", conn)

#### Q14: What are the regions where alternate titles are available?

#### Q15: List the titles of movies along with their runtimes converted from minutes to hours.

In [ ]:
pd.read_sql("""
    SELECT 
        primaryTitle, runtimeMinutes
    FROM title_basics
    WHERE titleType = "movie" AND runtimeMinutes IS NOT NULL;
""", conn)

#### Q16: What are all movies that got released between 2000 and 2010, inclusive?

In [ ]:
pd.read_sql("""
    SELECT *
    FROM title_basics
    WHERE titleType = "movie" AND 
""", conn)

### SQL Subqueries

#### Q17: What is the shortest movie released after 2010?

In [ ]:
pd.read_sql("""
    SELECT
    FROM title_basics
    WHERE startYear > 2010 AND titleType = 'movie' AND runtimeMinutes IS NOT NULL
""", conn)

In [ ]:
pd.read_sql("""
    SELECT *
    FROM title_basics
    WHERE runtimeMinutes
""", conn)

#### Q18: What is the longest movie released after 2010?

#### Q19: What are the titles that have a runtime greater than the average runtime of all movies?

In [ ]:
pd.read_sql("""
    SELECT 
    FROM title_basics
    WHERE runtimeMinutes IS NOT NULL
""", conn)

In [ ]:
pd.read_sql("""
    SELECT *
    FROM title_basics
    WHERE runtimeMinutes
""", conn)

#### Q20: What are the most recent movies?

#### Q21: Find the number of movies that have more than one genre.

We can find number of genres by simply counting number of commas and adding 1 to that count. Let's first determine length of genres column.

In [ ]:
pd.read_sql("""
    SELECT genres, ?
    FROM title_basics
""", conn)

To find, number of commas, we can replace commas with nothing and find difference between original string and the replaced string.

In [ ]:
pd.read_sql("""
    SELECT genres, LENGTH(genres) - LENGTH(REPLACE(genres, ',', '')) + 1
    FROM title_basics
""", conn)

Now putting it together in a subquery.

In [ ]:
pd.read_sql("""
    SELECT COUNT(*)
    FROM title_basics
    WHERE (
        SELECT LENGTH(genres) - LENGTH(REPLACE(genres, ',', '')) + 1
    ) > 1;
""", conn)

#### Q22: Find the titles of movies that have the maximum number of genres.

In [ ]:
pd.read_sql("""
    SELECT primaryTitle, genres
    FROM title_basics
    WHERE 
""", conn)

#### Q23: Find the titles of movies that belong to the same genres as those with a runtime longer than 150 minutes.

In [ ]:
pd.read_sql("""
    SELECT genres
    FROM title_basics
    WHERE titleType = "movie" AND runtimeMinutes > 150 AND genres IS NOT NULL
""", conn)

In [ ]:
pd.read_sql("""
    SELECT *
    FROM title_basics
    WHERE genres 
""", conn)

### JOINs

#### Q24: Find all movies and their corresponding ratings.

In [ ]:
pd.read_sql("""
    
""", conn)

#### Q25: List all movies and their associated genres.

In [ ]:
pd.read_sql("""
    
""", conn)

#### Q26: Find all crew members and the movies they worked on.

In [ ]:
pd.read_sql("""
    
""", conn)